package com.javarush.task.task03.task0306;

/* 
Головоломка со скобками
*/

public class Solution {
    public static void main(String[] args) {

        System.out.println(1 + 2  *( 3 + 4 * 5 + 6 * 7 + 8 * 9 + 10 * 11 + 12 * 13 + 14) + 15);
    }
}
/*Головоломка со скобками
        Расставить правильно (по другому) скобки, чтобы на экран вывелось число 850


        Требования:
        1. Программа не должна считывать данные с клавиатуры.
        2. Метод main должен выводить на экран число 850.
        3. Метод main должен содержать только один вызов System.out.println.
        4. Последовательность цифр и арифметических операций изменять нельзя.*/